In [1]:
import pandas as pd
import numpy as np

In [13]:
s = pd.Series(np.arange(-3, 3, 0.5))
cond = s > 0
s[(s > 0) | (s < 2.5)]
cond.all()
cond.any()
cond.sum()

5

In [25]:
# Создать серию такую, что элементы серии от -0.5 до 0.5 с шагом 0.1
# Элементы серии маркированы индексами от 'a' и далее по латинскому алфавиту
# Сколько элементов больше 0 и меньше 0.3
# У скольки элементов  четная дробная часть?

s = pd.Series(np.arange(-0.5, 0.5, 0.1), index=list('abcdefghij'))
cond = (s > 0) & (s < 0.3)
((round(s * 10) > 0) & (round(s * 10) < 3)).sum()
cond = round(abs(s) * 10) % 2 == 0
s[cond]

b   -4.000000e-01
d   -2.000000e-01
f   -1.110223e-16
h    2.000000e-01
j    4.000000e-01
dtype: float64

In [32]:
s.index
s = s.reindex(['a', 'b', 'z'], fill_value=0)

In [36]:
s.index = [1.1, 2.2, 3.3]
s.index = s.index.astype(int)
s

1   -0.5
2   -0.4
3    0.0
dtype: float64

In [43]:
s[1] = 10
s
s.pop(1)
s

2   -0.4
3    0.0
dtype: float64

In [48]:

df = pd.DataFrame(np.array([[1, 2], [3, 4]]))
df.columns = ['a', 'b']
len(df), len(test)

(2, 5)

In [50]:
test = pd.DataFrame(np.arange(1, 2, 0.2))
test

     0
0  1.0
1  1.2
2  1.4
3  1.6
4  1.8

In [52]:
df.size, test.size
df.shape, test.shape

((2, 2), (5, 1))

In [53]:
pd.DataFrame({'a': pd.Series([1, 1, 1, 1]), 'b': pd.Series([2, 2, 2, 2])})

   a  b
0  1  2
1  1  2
2  1  2
3  1  2

In [79]:
mse_df = pd.read_csv('https://docs.google.com/spreadsheets/d/1VSZqGFuDI9ebuBdSLPcy8Gyi9085eLuLnn9Kou7Ao6U/export?gid=0&format=csv', index_col=0)

In [70]:
mse_df[['2016', '2018']]
mse_df.loc['Всего проектов']
mse_df.iloc[[0, 2]]
mse_df.loc['Всего проектов']['2019']
mse_df.at['Всего проектов', '2016']
mse_df.iat[-1, -1]
mse_df.head(2)
mse_df.take([0, 1])
mse_df[:2]

                        2016  2017  2018  2019
Внедрено online курсов     0     4     1     0
Всего online курсов        0     4     1     1

In [73]:
mse_df[mse_df['2016'] > 1]
mse_df_T = mse_df.T
mse_df_T
mse_df_T[mse_df_T['Всего проектов'] > 10]

,Внедрено online курсов,Всего online курсов,Проекты. внедренные/готовые к внедрению,Всего индустриальных проектов/инструментов автоматизации,Всего проектов
2017,4,4,1,8,12
2018,1,1,5,10,11
2019,0,1,6,11,12

In [76]:
mse_df.drop('2016', axis=1, inplace=True)

In [78]:
mse_df.drop('Внедрено online курсов', axis=0)

                                                    2017  2018  2019
Всего online курсов                                    4     1     1
Проекты. внедренные/готовые к внедрению                1     5     6
Всего индустриальных проектов/инструментов авто...     8    10    11
Всего проектов                                        12    11    12

In [80]:
mse_df.rename(columns={'2016':'2020'})

                                                    2020  2017  2018  2019
Внедрено online курсов                                 0     4     1     0
Всего online курсов                                    0     4     1     1
Проекты. внедренные/готовые к внедрению                3     1     5     6
Всего индустриальных проектов/инструментов авто...     9     8    10    11
Всего проектов                                         9    12    11    12

In [82]:
prices = pd.read_csv('https://docs.google.com/spreadsheets/d/1VSZqGFuDI9ebuBdSLPcy8Gyi9085eLuLnn9Kou7Ao6U/export?gid=1501399475&format=csv', index_col=0)
prices['Округленная цена'] = prices['Цена'].round()
# prices.insert(0, <название столбца>, <значения>)

           Цена     Вес  Гликемический индекс  Округленная цена
Авокадо   170.0  222.40                    15             170.0
Апельсин   22.5  112.70                    40              22.0
Груша      20.2  157.65                    34              20.0
Киви       23.5   81.50                    51              24.0
Морковь    13.3  146.60                    35              13.0
Гранат    220.6  401.30                    30             221.0